Revit 2027 API
DefaultDivideSettings.GetSurfaceLayout Method
 Gets the default Divided Surface layout for U or V gridlines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpacingRuleLayout GetSurfaceLayout(
	UVGridlineType gridlines
)
Public Function GetSurfaceLayout (
	gridlines As UVGridlineType
) As SpacingRuleLayout
public:
SpacingRuleLayout GetSurfaceLayout(
	UVGridlineType gridlines
)
member GetSurfaceLayout :
        gridlines : UVGridlineType -> SpacingRuleLayout
Parameters
gridlines UVGridlineType
 U-gridlines or V-gridlines.
Return Value
SpacingRuleLayout
 The layout spacing rule.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace